[
  {
    "datetime_index": "201705021155",
    "title": "A Tale of GitHub Usernames",
    "short_desc": "Why dd Bruce Wayne call himself Batman, or Barry Allen call himself the Flash? Nicknames and alter egos in general, have a wide variety of interesting origin stories. This post is an honest attempt to crowd-source, collect and document the information about how the GitHub handles described in this post, came into existence.",
    "tags": [
      8,
      10
    ],
    "image_preview": "name.png",
    "images": [
      "say_my_name.gif",
      "not_bad.gif",
      "cooler_name.gif",
      "keeps_getting_cooler.gif",
      "vader.gif",
      "cool_at_naming.gif"
    ],
    "hyperlinks": [
      [
        "@kaustubhhiware",
        "https://github.com/kaustubhhiware"
      ],
      [
        "@nishnik",
        "https://github.com/nishnik"
      ],
      [
        "@lokeshh",
        "https://github.com/lokeshh"
      ],
      [
        "@hargup",
        "https://github.com/hargup"
      ],
      [
        "@Shekharrajak",
        "https://github.com/Shekharrajak"
      ],
      [
        "@athityakumar",
        "https://github.com/athityakumar"
      ],
      [
        "@kshitij10496",
        "https://github.com/kshitij10496"
      ],
      [
        "@vivekiitkgp",
        "https://github.com/vivekiitkgp"
      ],
      [
        "@shivani29456",
        "https://github.com/shivani29456"
      ],
      [
        "@geremih",
        "https://github.com/geremih"
      ],
      [
        "@amrav",
        "https://github.com/amrav"
      ],
      [
        "@raincrash",
        "https://github.com/raincrash"
      ],
      [
        "@zverok",
        "https://github.com/zverok"
      ],
      [
        "@DefCon-007",
        "https://github.com/DefCon-007"
      ],
      [
        "@americast",
        "https://github.com/americast"
      ],
      [
        "@ghostwriternr",
        "https://github.com/ghostwriternr"
      ],
      [
        "@the-ethan-hunt",
        "https://github.com/the-ethan-hunt"
      ],
      [
        "@zorroblue",
        "https://github.com/zorroblue"
      ],
      [
        "@Parth-Vader",
        "https://github.com/Parth-Vader"
      ],

      [
        "@OrkoHunter",
        "https://github.com/OrkoHunter"
      ],
      [
        "this",
        "http://monster10.com/The-10-Worst-Cartoon-Characters-Ever.htm"
      ],
      [
        "@debugger22",
        "https://github.com/debugger22"
      ],
      [
        "Website",
        "https://github.audio/"
      ],
      [
        "Repository",
        "https://github.com/debugger22/github-audio"
      ],
      [
        "@icyflame",
        "https://github.com/icyflame"
      ],
      [
        "@v0dro",
        "https://github.com/v0dro"
      ],
      [
        "'Daru'",
        "https://github.com/SciRuby/daru"
      ],
      [
        "athityakumar@gmail.com",
        "mailto:athityakumar@gmail.com"
      ]
    ],
    "html_content": "<p> <span style='display:block; float:left; font-size: 200%;  color:#ffffff; margin-top:5px; margin-right:8px; padding: 10px 20px 10px 20px; text-align:center; background-color: #000;'>E</span>ver wondered what could be the possible reason behind the different usernames / alter egos of people around you? Well, it is this eerie mystery that this blog post aims to cover, around my circle of friends and mentors - at least, on the GitHub platform. Before starting with the actual blog post, I'd like to provide you with spoiler alert to some memes that have been picked up from the scenes of TV series - 'The Flash' and 'Breaking Bad'.</p><br><div class='ui horizontal divider'>Not all heroes wear a mask</div><img class='ui centered image'><p>Indeed. There are many users who prefer to have a mainstream username, which directly exposes their name. The most common reason behind this is that, a mainstream username looks more 'official' at first sight. Need I give any explanation for the below handles?<h4><ul class='ui list'><li><a> (Kaustubh Hiware)</li><li><a> (Nishant Nikhil)</li><li><a> (Lokesh Sharma)</li><li><a> (Harsh gupta)</li><li><a> (Shekhar Prasad Rajak)</li></ul></h4><p>Infact, I myself belong to this category. My GitHub username is <a> - and I went for a mainstream username because my name was already spelled weirdly enough, that I didn't even have to think of a more weirder username.</p><br><div class='ui horizontal divider'>Some heroes wear a psuedo-mask</div><img class='ui centered image'><p>By a psuedo-mask, I mean that these usernames reveal the user's name - but it's not just the name that is being revealed.<h4><ul class='ui list'><li><a> (Kshitij Saraogi) <span style='font-weight:100;'> <br><br> Kshitij truly believes that the Date of Birth of an individual is something that makes the individual unique, and has hence included his Date of Birth (10/04/1996) in his username.</span></li><br><li><a> (Vivek Rai) <span style='font-weight:100;'> <br><br> Vivek Rai is a (final-year) student of IIT Kharagpur, and has hence added the Institute name (iitkgp) to his username.</span></li><br><li><a> (Shivani Sharma) <span style='font-weight:100;'> <br><br> Shivani had obtained an All India Rank of 29456 in JEE(Mains) - one of the most competitive college entrance exams in India. Hence, she has added it in her username.</span></li></ul></h4><br><div class='ui horizontal divider'>Some heroes love string manipulation</div><img class='ui centered image'><p>These are the usernames from which the user's name can't be guessed directly - but a corelation between the name and username can certainly be derived.</p><h4><ul class='ui list'><li><a> (Mihir Rege)<span style='font-weight:100;'> <br><br> The 'Rege' in the name has been transformed to 'gere' in the username, and 'mih' from Mihir has been added at the end. Hence, the username - @geremih.</span></li><br><li><a> (Vikrant Varma) <span style='font-weight:100;'> <br><br> Simply reverse the last name 'Varma' and behold - it's @amrav.</span></li><br><li><a> (Sri Charan) <span style='font-weight:100;'> <br><br> Time to play Anagrams! The letters in the name have been smartly rearranged to provide the username, which even looks meaningful.</span></li></ul></h4><br><div class='ui horizontal divider'>Some heroes prefer a secret identity</div><img class='ui centered image'><p>The usernames below have no relation whatsoever to the user's name, and a corelation can't be drawn even after the user's name is known. In most cases, only the user knows the story behind their username.</p><h4><ul class='ui list'><li><a> (Victor Shepelev)<span style='font-weight:100;'> <br><br> 'zverok' has been the default username of Victor for nearly the past 15 years. The username has Russian origins, and it means 'a small beast' in Russian (зверёк). Seemingly, this was username was selected randomly from the absurd play(s) that Victor had written with his friends of that time.</span></li><br><li><a> (Ayush Goyal)<span style='font-weight:100;'> <br><br> DefCon is the largest hacking convention, held annually at Las Vegas - Ayush first took this as his nickname for Counter-Strike gaming within the Institute. But as this username was already taken on GitHub, Ayush added the James Bond number '007', and made himself known as 'DefCon-007' on GitHub.</span></li><br><li><a> (Sayan Sinha)<span style='font-weight:100;'> <br><br> Sayan had crafted this nickname in his 5th grade itself. During one of the Geography lectures, he came across the different Timezones, and was more attracted to the American Standard Time more than Indian Standard Time. Hence, he had decided that he'd keep himself as @americanst in the digital world to not showcase any details about him. However, a typo while creating his first Yahoo account made sure that he'd rather be called as @americast on all social media platforms. Although a typo, @americast does sound more cooler than @americanst - so, I guess it can be considered a 'Wonder Blunder'.</span></li><br><li><a> (Naresh Ramesh)<span style='font-weight:100;'> <br><br> Many years ago, Naresh had chosen 'ghost_000' as his first linux user account name. He was also a part of Technology Literary Society of IIT Kharagpur due to his interest in writing. Hence, combining `ghost' from ghost_000, 'writer' from writing, 'n' from Naresh and 'r' from Ramesh, the username 'ghostwriternr' was born.</span></li><br><li><a> (Dhruv Apte)<span style='font-weight:100;'> <br><br> Being a fan of the 'Mission Impossible' set of movies, Dhruv named himself as 'Ethan Hunt' in one of the Mini Militia gaming marathon in his Institute. Gradually rising among the ranks in the game, Dhruv got a good vibe from this nickname and went on to change his presence in all social media platforms to Ethan Hunt. Wanting to be unique, he chose the username 'the-ethan-hunt'. </span></li><br><li><a> (Rameshwar Bhaskaran)<span style='font-weight:100;'> <br><br> Being a hardcore fan of Beyblade's Kai and Zorro animated series, he wanted a username like Kai / Zorro. However, both Kai and Zorro usernames were already taken on GitHub. Hence, he combined Zorro, with his favourite color (Blue) - resulting in @zorroblue.</span></li><br><li><a> (Parth Verma)<span style='font-weight:100;'> <br><br> This is pretty obvious. Being a Star Wars fan, Parth combined his first name with the last name of the most powerful Jedi that ever lived (Vader from Darth Vader) to end up with his username @Parth-Vader.</span></li><br><img class='ui centered image'></ul></h4><h4>Oh, and here are the 'BROs at OSS' - ie, real-life brothers who're doing big at open-source.</h4><h4><ul class='ui list'><li><a> (Himanshu Mishra) <span style='font-weight:100;'> <br><br> Being another fan of the 'Mission Impossible' movies, Himanshu wanted a nickname that included Hunt / Huner. However, as Hunter seemed like a surname, he began searching for a first name that he could use with Hunter. After literally searching for 'Worst Cartoon Charecters', the then Google redirected him to <a> page. Being the lazy guy he is, he chose the the cartoon character which was shown on the top of that page rather than scrolling down - Orko. This is how @OrkoHunter came into existence.</span></li><br><li><a> (Sudhanshu Mishra)<span style='font-weight:100;'> <br><br> Combining 'debugger' and his date of birth (22), the username @debugger22 made it's way into the GitHub world and went on to create GitHub-Audio ( <a> | <a> ).</span></li></ul></h4><br><div class='ui horizontal divider'>But when secret identity is too much a secret...</div><img class='ui centered image'><p>When secret identity becomes too much a secret, even the users themselves can't come up with a legit reason for their username. Readers are welcome to share their own fan-fiction theories about how the below usernames might have come into existence, in the comment section below.</p><h4><ul class='ui list'><li><a> (Siddharth Kannan)<span style='font-weight:100;'> <br><br> Though Siddharth claims that he hadn't come across 'A Song of Ice and Fire' novel before fixing his username, the username 'icy' (Ice) + 'flame' (Fire) does perfectly blend in with this novel's name.</span></li><br><li><a> (Sameer Deshmukh) <span style='font-weight:100;'> <br><br> Sameer was once interning in a company, when his boss asked him what he'd like to call himself on GitHub. For some 'unknown' reason, Sameer chose @v0dro as his handle, and started to like it ever since. It's also noteworthy to mention that he also went on to start the project <a> (Acronym of Data Analysis in RUby, and also coincidentally the Hindi word for Booze), which has been taken under the patronage of SciRuby organization.</span></li><br></ul></h4><br><div class='ui horizontal divider'>CONCLUSION</div><p> A huge token of thanks to everyone who shared the story behind their GitHub username! If possible, I'd also try to come up with a part-2 of this post which may not be restricted to just GitHub usernames. If you'd like to get your story featured in that post, shoot me a mail at <a>. What do you think about this blog post? Leave your thoughts in the comments section below.</p>",
    "disqus_identifier": "cxnmtydelazpqfbkjiwsrovuhg"
  }
]